# git init -> превращает текущую директорию в git репозиторий (создается .git)
# git add . -> (.-> все файлы, можно указать отдельные файлы) -> отслеживание всех файлов 
# git commit -m 'commit' -> добавляет/совершает сохраниение в файлов, которые находяться в индексе  
# git log -> выводит журнал (log) сохранений
# git status -> показывает статус файлов
# git remote add origin(название связи - обычно origin) SSH(ссылка на удаленный  репозиторий)
# git checkout hash_commit -> просматриваем версию
# git branch -> выводит в терминал список всех веток (звездочкой помечена активная ветка)
# git checkout <название_ветки>
#                               . переход на указанную ветку
# git switch <название ветки>

# git push origin (название_связи) master(название_ветки) -> отправка нашей версии кода на удаленный репозиторий

# git clone <ссылка на удаленный репозиторий> -> склонировать/скопировать/скачать репозиторий  

''''''
